In [4]:
import pandas as pd

In [17]:
names_df = pd.read_csv("name.basics_sample_500.tsv", sep="\t")
names_df.sample(n=2)

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
144,nm0000145,Sherilyn Fenn,1965,\N,"actress,soundtrack","tt0100935,tt0098936,tt0105046,tt0092240"
283,nm0000284,Adam Baldwin,1962,\N,"actor,soundtrack","tt0116629,tt0093058,tt0100403,tt0379786"

In [51]:
eu_weather_df = pd.DataFrame({
  "town": ["Atina", "Oslo", "London"],
  "temp":[35,21,25],  
  "rain": [False, False, True ]
})
eu_weather_df = eu_weather_df[["town", "temp","rain"]]

# TODO
# eu_weather_df.astype({"temp": str})
# eu_weather_df["temp"].dty
eu_weather_df

     town  temp   rain
0   Atina    35  False
1    Oslo    21  False
2  London    25   True

In [53]:
wind_df=pd.DataFrame([3.4, 2,6.5], columns=["wind"])
wind_df

   wind
0   3.4
1   2.0
2   6.5

In [60]:
df_new = pd.concat([eu_weather_df, wind_df],axis=0)
df_new

    rain  temp    town  wind
0  False  35.0   Atina   NaN
1  False  21.0    Oslo   NaN
2   True  25.0  London   NaN
0    NaN   NaN     NaN   3.4
1    NaN   NaN     NaN   2.0
2    NaN   NaN     NaN   6.5

In [63]:
df_new.count()

rain    3
temp    3
town    3
wind    3
dtype: int64